In [6]:
# import the usual
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [7]:
# TODO: difference bewtween NaN and None? Why use NaN?

# ser1
# 2, nan, 4, nan, 6, nan

# index Q R S T U V

ser1 = Series([2,np.nan,4,np.nan,6,np.nan], index=list('QRSTUV'))

In [16]:
# ser2
# range length ser1
# same index as ser1

ser2 = Series(np.arange(len(ser1)),index=ser1.index)

In [23]:
# create series where value of series 2 is chosen if series 1 is null, else series2

ser = Series(np.where(np.isnan(ser1),ser2,ser1))

# alternative

ser = Series(np.where(pd.isnull(ser1),ser2,ser1), index=ser1.index)

In [25]:
ser

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [26]:
ser1.combine_first(ser2)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [28]:
nan = np.nan

dframe_odds = DataFrame(
    {'X':[1,nan, 3, nan], 
    'Y':[nan,5,nan,7],
    'Z':[nan,9, nan, 11]
    }
)

dframe_odds

     X    Y     Z
0  1.0  NaN   NaN
1  NaN  5.0   9.0
2  3.0  NaN   NaN
3  NaN  7.0  11.0

In [35]:
dframe_evens = DataFrame({
    'X':[2,4,nan, 6, 8],
    'Y':[nan, 10., 12., 14., 16.]
})

dframe_evens

     X     Y
0  2.0   NaN
1  4.0  10.0
2  NaN  12.0
3  6.0  14.0
4  8.0  16.0

In [36]:
dframe_odds.combine_first(dframe_evens)

     X     Y     Z
0  1.0   NaN   NaN
1  4.0   5.0   9.0
2  3.0  12.0   NaN
3  6.0   7.0  11.0
4  8.0  16.0   NaN